[
  {
    "companyName": "Third Bridge",
    "companyInfo": "Homepageinline-flag-eninline-flag-zh-hansinline-flag-eninline-flag-eninline-flag-zh-hansinline-flag-eninline-icon-arrowinline-icon-arrowinline-icon-arrowinline-icon-arrow",
    "jobDescription": "Job Description As an Account Management Associate, you’ll help your book of clients to access the full suite of research solutions Third Bridge offers. You will proactively contact investment professionals and/or consultants within our client base on a day-to-day basis, building rapport and credibility to drive end-users towards our services. With training and support from your close-knit team, you’ll gain a deep understanding of our products, our clients’ preferences and needs, and ensure the…",
    "location": "Mumbai, Maharashtra",
    "listingDate": "2024-09-10T22:04:23Z",
    "careersPage": null,
    "emails": []
  },
  {
    "companyName": "Miratech",
    "companyInfo": "35+ Years in Software Development, IT Consulting, and CX.",
    "jobDescription": "Job Description Our client is a leading cloud contact center platform offering advanced tools for call routing, analytics, and automation. It enhances customer service, increases efficiency, and supports seamless omnichannel interactions, empowering businesses to deliver exceptional customer experiences. We are welcome an innovative and proactive Senior Fullstack Developer with webRTC exposure to join us and contribute to our customer's global-scaled solutions.The project you would be involved …",
    "location": "India",
    "listingDate": "2024-10-03T04:55:37Z",
    "careersPage": "https://miratechgroup.com/career/",
    "emails": []
  },
  {
    "companyName": "Lifelancer",
    "companyInfo": "AI-Powered Talent Hiring Platform in Life Sciences, Pharma & IT",
    "jobDescription": "Project Role : Application Developer Project Role Description : Design, build and configure applications to meet business process and application requirements. Must have skills : Veeva CRM Good to have skills : Extract Transform and Load Minimum 3 Year(s) Of Experience Is Required Educational Qualification : 15 years full time education Summary: As an Application Developer, you will design, build, and configure applications to meet business process and application requirements. You will be resp…",
    "location": "Pune, Maharashtra",
    "listingDate": "2024-09-20T02:41:38Z",
    "careersPage": null,
    "emails": []
  },
  {
    "companyName": "Velotio Technologies",
    "companyInfo": "Bike Technologies for sale | eBayeBay Home",
    "jobDescription": "About Velotio: Velotio Technologies is a product engineering company working with innovative startups and enterprises. We are a certified Great Place to Work® and recognized as one of the best companies to work for in India. We have provided full-stack product development for 110 startups across the globe building products in the cloud-native, data engineering, B2B SaaS, IoT & Machine Learning space. Our team of 400 elite software engineers solves hard technical problems while transforming cust…",
    "location": "India",
    "listingDate": "2024-09-16T12:28:23Z",
    "careersPage": null,
    "emails": []
  },
  {
    "companyName": "Western Digital",
    "companyInfo": "Western Digial for sale | eBayeBay Home",
    "jobDescription": "Job Description Job Description: Primarily managing enterprise storage systems in global data centers and business offices. Storage disciplines should focus on Dell PowerMax, Dell Unity, Dell Isilon, NetApp Cluster mode, Dell ECS, Nasuni Cloud Appliance as well as Brocade Fabric and Backups (NetBackup primarily). Must have working knowledge Linux systems, Windows & VMWare. Working knowledge for the functions of - Network and Infrastructure Security, Capacity Planning, Performance Management, Hi…",
    "location": "Bangalore, Karnataka",
    "listingDate": "2024-10-02T16:57:35Z",
    "careersPage": null,
    "emails": []
  },
  {
    "companyName": "Navigate Virtual CFOs",
    "companyInfo": "Your Personal CFO | Navigate Virtual CFOs",
    "jobDescription": "About the job Job Required: Experience in handling a team of 5-6 members Leadership and team management skills Proficient written & verbal communication in English Expertise in Book keeping, journals management and finalization Experience in Xero accounting Software Accuracy in all tasks Job Description: Manage the Financial Accounting including Month end journals and processes. Payroll and related tasks Prepare annual financial statements in accordance with Australian Accounting Standards (AAS…",
    "location": "Calico Mills, Ahmedabad",
    "listingDate": "2024-05-31T22:27:48Z",
    "careersPage": null,
    "emails": []
  },
  {
    "companyName": "Underwriting Solutions",
    "companyInfo": "UL SolutionsUL LogoUL Logo",
    "jobDescription": "Job Description We are looking for a strong and motivated software developer to work as part of a team developing and implementing innovative software solutions. You will work closely with a cross-functional team of developers, QA engineers, and product owners in a fast-paced and cutting-edge environment. You will always find new challenges that excite you and keep you motivated. Responsibilities: Design and develop software applications supporting business objectives Maintain, enhance, and sup…",
    "location": "India",
    "listingDate": "2024-10-04T04:51:04Z",
    "careersPage": "https://www.ul.com/careers",
    "emails": []
  },
  {
    "companyName": "2coms",
    "companyInfo": "Find talent that transforms your organizations | 2COMS #TheHumanSideofThings",
    "jobDescription": "Opening is for One of The Top MNC Company into Building Automation. Position : Sr Exe Service Sales Location : Chennai Experience: Min 4-5 years ü E nsu re t a r g e t f u l f i l m e n t o f S e r v ic e c on tr a c t r e ne w al s ü P la n a n d e x ecu te agg r e s si v e S e r v ic e Sales drives / ca m p s f o r u p - s ell i n g & c r o s s - s el l in g o f h igh -e n d s e r v ic e pl a ns , r e tr o f i t p r op o sa l s a n d V alu e A dde d O ff e rs ü I den t i fy an d r ec o m m en…",
    "location": "Shakti Nagar, North Delhi",
    "listingDate": "2024-09-21T03:26:48Z",
    "careersPage": null,
    "emails": [
      "exemployeebgv@2coms.com"
    ]
  },
  {
    "companyName": "IBA Infotech Inc.",
    "companyInfo": "IBA InfoTech Inc. | LinkedIn",
    "jobDescription": "Job Description Job Title: Bench Sales Consultant Location: Noida, Uttar Pradesh (Onsite) Salary: DOE Experience: 2-4 Years Job Description: We are seeking a motivated Bench Sales Consultant with 2 to 4 years of experience in the US IT staffing industry. The role involves marketing available bench consultants to clients, negotiating rates, building strong client relationships, and ensuring successful placements. The ideal candidate should have experience with US recruitment processes, job porta…",
    "location": "Noida, Ghaziabad",
    "listingDate": "2024-10-01T16:47:12Z",
    "careersPage": "https://www.linkedin.com/signup?session_redirect=https%3A%2F%2Fwww.linkedin.com%2Ffeed%2Fhashtag%2Fdigitalmarketingcareer&trk=organization_guest_main-feed-card-text",
    "emails": [
      "hr.iba@ibainfotech.co.in",
      "hr.iba@ibainfotech.co.in?trk=organization_guest_main-feed-card-text"
    ]
  },
  {
    "companyName": "Ethics Group of Companies",
    "companyInfo": "Ethics Group Of Companies: India's Leading Tech-Based End-to-End Supply Chain Company",
    "jobDescription": "Key Responsibilities: Accurately pick and pack pharmaceutical products based on order specifications. Ensure proper labeling and packaging to maintain product integrity. Conduct quality checks to ensure the correct items are picked and packed. Maintain cleanliness and organization in the warehouse. Assist with inventory management and stock replenishment. Location - ETHICS PROSPERITY PVT. LTD. S.G.S. WAREHOUSE No: 6/1A, S.No.8/2 & S.NO.13/3, Orakkadu Road, Solipalayam, Sholavaram, Ponneri Taluk…",
    "location": "India",
    "listingDate": "2024-09-26T16:07:20Z",
    "careersPage": "https://ethicsgroup.in/careers",
    "emails": [
      "info@ethicsgroups.in"
    ]
  },
  {
    "companyName": "U S TRANSPORT SERVICE",
    "companyInfo": "MyUS.com - Buy what you love from US and UK stores and ship to India",
    "jobDescription": "We are looking for an Accounts Receivable Manager to oversee the entire process of collecting payments from our company’s customers. The main responsibilities for this role include managing invoices, handling missed payments and supervising Accounts Receivable Clerks. Our ideal candidate is familiar with all accounting procedures and can manage daily financial transactions end-to-end. If you have previous experience managing a financial team, we’d like to meet you. Ultimately, you should be abl…",
    "location": "India",
    "listingDate": "2024-08-30T08:14:48Z",
    "careersPage": null,
    "emails": []
  }
]