[
  {
    "companyName": "Miratech",
    "companyInfo": "Miratech Group - A Global Leader in IT Outsourcing",
    "jobDescription": "Job Description Our client is a leading cloud contact center platform offering advanced tools for call routing, analytics, and automation. It enhances customer service, increases efficiency, and supports seamless omnichannel interactions, empowering businesses to deliver exceptional customer experiences. We are welcome an innovative and proactive Senior Fullstack Developer with webRTC exposure to join us and contribute to our customer's global-scaled solutions.The project you would be involved …",
    "location": "India",
    "listingDate": "2024-10-03T04:55:37Z",
    "careersPage": "https://miratechgroup.com/career/",
    "emails": []
  },
  {
    "companyName": "Lifelancer",
    "companyInfo": "Redirecting to Jobtome | Blackboardjob",
    "jobDescription": "Project Role : Application Developer Project Role Description : Design, build and configure applications to meet business process and application requirements. Must have skills : Veeva CRM Good to have skills : Extract Transform and Load Minimum 3 Year(s) Of Experience Is Required Educational Qualification : 15 years full time education Summary: As an Application Developer, you will design, build, and configure applications to meet business process and application requirements. You will be resp…",
    "location": "Pune, Maharashtra",
    "listingDate": "2024-09-20T02:41:38Z",
    "careersPage": null,
    "emails": []
  },
  {
    "companyName": "Velotio Technologies",
    "companyInfo": "Velotio | Product Engineering Partner for Startups and Enterprises | Clutch: 4.7/5",
    "jobDescription": "About Velotio: Velotio Technologies is a product engineering company working with innovative startups and enterprises. We are a certified Great Place to Work® and recognized as one of the best companies to work for in India. We have provided full-stack product development for 110 startups across the globe building products in the cloud-native, data engineering, B2B SaaS, IoT & Machine Learning space. Our team of 400 elite software engineers solves hard technical problems while transforming cust…",
    "location": "India",
    "listingDate": "2024-09-16T12:28:23Z",
    "careersPage": "https://www.velotio.com/careers",
    "emails": [
      "kumar.kothare@velotio.com",
      "ruchita@velotio.com",
      "contact@velotio.com"
    ]
  },
  {
    "companyName": "Western Digital",
    "companyInfo": "Western Digital Corporation and Company Information | Western Digital",
    "jobDescription": "Job Description Job Description: Primarily managing enterprise storage systems in global data centers and business offices. Storage disciplines should focus on Dell PowerMax, Dell Unity, Dell Isilon, NetApp Cluster mode, Dell ECS, Nasuni Cloud Appliance as well as Brocade Fabric and Backups (NetBackup primarily). Must have working knowledge Linux systems, Windows & VMWare. Working knowledge for the functions of - Network and Infrastructure Security, Capacity Planning, Performance Management, Hi…",
    "location": "Bangalore, Karnataka",
    "listingDate": "2024-10-02T16:57:35Z",
    "careersPage": "https://jobs.westerndigital.com/",
    "emails": [
      "jobs@wdc.com"
    ]
  },
  {
    "companyName": "Navigate Virtual CFOs",
    "companyInfo": "Your Personal CFO | Navigate Virtual CFOs",
    "jobDescription": "About the job Job Required: Experience in handling a team of 5-6 members Leadership and team management skills Proficient written & verbal communication in English Expertise in Book keeping, journals management and finalization Experience in Xero accounting Software Accuracy in all tasks Job Description: Manage the Financial Accounting including Month end journals and processes. Payroll and related tasks Prepare annual financial statements in accordance with Australian Accounting Standards (AAS…",
    "location": "Calico Mills, Ahmedabad",
    "listingDate": "2024-05-31T22:27:48Z",
    "careersPage": null,
    "emails": []
  },
  {
    "companyName": "Underwriting Solutions",
    "companyInfo": "Talent.com",
    "jobDescription": "Job Description We are looking for a strong and motivated software developer to work as part of a team developing and implementing innovative software solutions. You will work closely with a cross-functional team of developers, QA engineers, and product owners in a fast-paced and cutting-edge environment. You will always find new challenges that excite you and keep you motivated. Responsibilities: Design and develop software applications supporting business objectives Maintain, enhance, and sup…",
    "location": "India",
    "listingDate": "2024-10-04T04:51:04Z",
    "careersPage": null,
    "emails": []
  },
  {
    "companyName": "2coms",
    "companyInfo": "2COMS Consulting Pvt. Ltd. | LinkedIn",
    "jobDescription": "Opening is for One of The Top MNC Company into Building Automation. Position : Sr Exe Service Sales Location : Chennai Experience: Min 4-5 years ü E nsu re t a r g e t f u l f i l m e n t o f S e r v ic e c on tr a c t r e ne w al s ü P la n a n d e x ecu te agg r e s si v e S e r v ic e Sales drives / ca m p s f o r u p - s ell i n g & c r o s s - s el l in g o f h igh -e n d s e r v ic e pl a ns , r e tr o f i t p r op o sa l s a n d V alu e A dde d O ff e rs ü I den t i fy an d r ec o m m en…",
    "location": "Shakti Nagar, North Delhi",
    "listingDate": "2024-09-21T03:26:48Z",
    "careersPage": "https://www.linkedin.com/signup?session_redirect=https%3A%2F%2Fwww.linkedin.com%2Ffeed%2Fhashtag%2Fcareer&trk=organization_guest_main-feed-card-text",
    "emails": []
  },
  {
    "companyName": "IBA Infotech Inc.",
    "companyInfo": "IBA InfoTech Inc. | LinkedIn",
    "jobDescription": "Job Description Job Title: Bench Sales Consultant Location: Noida, Uttar Pradesh (Onsite) Salary: DOE Experience: 2-4 Years Job Description: We are seeking a motivated Bench Sales Consultant with 2 to 4 years of experience in the US IT staffing industry. The role involves marketing available bench consultants to clients, negotiating rates, building strong client relationships, and ensuring successful placements. The ideal candidate should have experience with US recruitment processes, job porta…",
    "location": "Noida, Ghaziabad",
    "listingDate": "2024-10-01T16:47:12Z",
    "careersPage": "https://www.linkedin.com/signup?session_redirect=https%3A%2F%2Fwww.linkedin.com%2Ffeed%2Fhashtag%2Fdigitalmarketingcareer&trk=organization_guest_main-feed-card-text",
    "emails": [
      "hr.iba@ibainfotech.co.in",
      "hr.iba@ibainfotech.co.in?trk=organization_guest_main-feed-card-text"
    ]
  },
  {
    "companyName": "Ethics Group of Companies",
    "companyInfo": "Ethics Group Of Companies: India's Leading Tech-Based End-to-End Supply Chain Company",
    "jobDescription": "Key Responsibilities: Accurately pick and pack pharmaceutical products based on order specifications. Ensure proper labeling and packaging to maintain product integrity. Conduct quality checks to ensure the correct items are picked and packed. Maintain cleanliness and organization in the warehouse. Assist with inventory management and stock replenishment. Location - ETHICS PROSPERITY PVT. LTD. S.G.S. WAREHOUSE No: 6/1A, S.No.8/2 & S.NO.13/3, Orakkadu Road, Solipalayam, Sholavaram, Ponneri Taluk…",
    "location": "India",
    "listingDate": "2024-09-26T16:07:20Z",
    "careersPage": "https://ethicsgroup.in/careers",
    "emails": [
      "info@ethicsgroups.in"
    ]
  },
  {
    "companyName": "U S TRANSPORT SERVICE",
    "companyInfo": "MyUS.com - Buy what you love from US and UK stores and ship to India",
    "jobDescription": "We are looking for an Accounts Receivable Manager to oversee the entire process of collecting payments from our company’s customers. The main responsibilities for this role include managing invoices, handling missed payments and supervising Accounts Receivable Clerks. Our ideal candidate is familiar with all accounting procedures and can manage daily financial transactions end-to-end. If you have previous experience managing a financial team, we’d like to meet you. Ultimately, you should be abl…",
    "location": "India",
    "listingDate": "2024-08-30T08:14:48Z",
    "careersPage": null,
    "emails": []
  },
  {
    "companyName": "AccorHotel",
    "companyInfo": "Choose the web agency Blastness for your hotel website",
    "jobDescription": "Job Description First impressions are everything As a GSA-Front Office, you will take care of the guests from the moment they arrive through to their departure by ensuring they have a memorable experience with us. What you will be doing: Greet, check-in, respond to requests and settle accounts while providing exceptional service Take initiative to add a personalized experience Proudly promote the hotel facilities, looking for opportunities to enhance a guest’s stay through up-selling Maintain h…",
    "location": "Vijayawada, Krishna",
    "listingDate": "2024-09-08T03:53:18Z",
    "careersPage": null,
    "emails": [
      "info@blastness.com",
      "assistenza@blastness.com",
      "helpdesk@blastness.com"
    ]
  },
  {
    "companyName": "Bosch Group",
    "companyInfo": "Bosch Parts for sale | eBayeBay Home",
    "jobDescription": "Job Description Implementation and Configuration: Configuration of SAP SuccessFactors modules Learning Management System (LMS), Recruitment and Candidate Management (RCM & RMK), Compensation (Comp), Variable Pay (VP), Workforce Analytics (WFA), Employee Central Time Tracking, and Succession Management (SP) & Career Development Planning and Mentoring (CDP), People Analytics: Reporting & Work Zone to meet business requirements. System Design: Design and develop customized solutions within SAP Suc…",
    "location": "Bangalore, Karnataka",
    "listingDate": "2024-09-26T22:37:51Z",
    "careersPage": null,
    "emails": []
  },
  {
    "companyName": "2coms",
    "companyInfo": "Find talent that transforms your organizations | 2COMS #TheHumanSideofThings",
    "jobDescription": "About the client: Our client is an IT Technology & Services Management MNC , supporting millions of internal and external customers with state of-the-art IT solutions to everyday problems & dedicated to bringing digital innovations to every aspect of the landscape of insurance. Our Client is a part of one of the major insurance groups based out of Germany and Europe. The Group is represented in around 26 countries worldwide, with Over 37,000 people worldwide, focusing mainly on Europe and Asia …",
    "location": "Bazargate, Mumbai",
    "listingDate": "2024-10-02T00:21:21Z",
    "careersPage": null,
    "emails": [
      "exemployeebgv@2coms.com"
    ]
  },
  {
    "companyName": "Rentokil Initial",
    "companyInfo": "\n\tRentokil Initial plc\n",
    "jobDescription": "Rentokil PCI is the leading pest control service provider in India. A Rentokil Initial brand, Rentokil PCI was formed in 2017 through a joint venture (JV) between Pest Control India, the number one pest control company in India, and Rentokil, the world’s leading pest control brand. Rentokil PCI aims to set new standards for customer service with operations across 250 locations in India. The JV brand also focuses on developing industry-leading service operations through the sharing of best pract…",
    "location": "India",
    "listingDate": "2024-09-16T18:25:49Z",
    "careersPage": "https://careers.rentokil-initial.com/",
    "emails": []
  },
  {
    "companyName": "The Children's Investment Fund Foundation",
    "companyInfo": "\n\n",
    "jobDescription": "This is a 1 year fixed-term role in CIFF’s India Climate Programme team, accountable for strategy development, leading on a number of significant programmes and programme implementation. This includes, but is not limited to, taking leadership on India climate portfolio – clean energy transition in power sector, air quality, sustainable cooling, electric mobility, climate resilient agriculture, climate smart cities, and on the intersection of all the sectors at the sub-national level and taking …",
    "location": "India",
    "listingDate": "2024-10-02T01:48:38Z",
    "careersPage": null,
    "emails": [
      "online.cell@sbilife.co.in"
    ]
  },
  {
    "companyName": "Opalforce, Inc.",
    "companyInfo": "Opalforce – Future Ready",
    "jobDescription": "About the Job: Opalforce is hiring Mechanical Design Engineers Key Responsibilities: Create requirements and specifications for business solutions Conduct business analysis and research to identify opportunities for improvement Consult with key stakeholders to determine business objectives and success factors Collaborate with team members to collect, analyze, and evaluate information from multiple sources including Present findings and recommendations to stakeholders Write and document business…",
    "location": "Bangalore, Karnataka",
    "listingDate": "2024-06-07T16:37:08Z",
    "careersPage": null,
    "emails": []
  },
  {
    "companyName": "Cynosure Corporate Solutions",
    "companyInfo": "Cynosure Corporate Solutions",
    "jobDescription": "Collaborate with clients to understand their design preferences and functional needs Develop and present design concepts, including mood boards, floor plans, and 3D renderings Create detailed project proposals, including materials, furniture, and decor selections Oversee the implementation of design plans, including coordination with contractors and vendors Manage project budgets and timelines to ensure successful and timely completion Keep up to date with the latest design trends, innovations,…",
    "location": "Coimbatore South, Coimbatore",
    "listingDate": "2024-09-24T01:34:45Z",
    "careersPage": "https://cynosurejobs.net/careers.php",
    "emails": [
      "corp@cynosurejobs.com"
    ]
  },
  {
    "companyName": "Trigent Software Private Limited",
    "companyInfo": "Custom Software development and Testing Company USA | Trigent",
    "jobDescription": "Summary: As a Full Stack Engineer, you will be responsible for developing and engineering end-to-end features of a system, from user experience to backend code. Your typical day will involve working with Spring Boot, Spring Application Framework, and Amazon Web Services (AWS) to deliver innovative solutions that help our clients improve the services they provide. Roles & Responsibilities: - Design and develop high-quality software solutions using Spring Boot and Spring Application Framework. - …",
    "location": "Tondiarpet Fort St George, Chennai",
    "listingDate": "2024-10-04T05:18:56Z",
    "careersPage": "https://trigent.com/careers",
    "emails": []
  },
  {
    "companyName": "Speed Engineering Solutions Pvt Ltd",
    "companyInfo": "About Us – Speed Engineering Solutions",
    "jobDescription": "Roles and Responsibilities: Review static equipment drawings, 3D models, and piping drawings for accuracy, completeness, and compliance with engineering standards, specifications, and regulatory requirements. Verify dimensional accuracy, material specifications, weld details, assembly requirements, and functional interfaces between static equipment and piping systems. Ensure that drawings and models adhere to industry codes and standards (e.g., ASME, API, TEMA, En, AD, DIN) as well as company-s…",
    "location": "Gokhalenagar, Pune",
    "listingDate": "2024-08-22T03:08:17Z",
    "careersPage": "https://speed-global.com/about-us/#tabs_desc_273_6",
    "emails": []
  },
  {
    "companyInfo": "25 Stunning Corporate Websites to Inspire Yours ",
    "jobDescription": "Neeuro is looking for an Appointment Setting Executive in the India to work with our Business Development teams.? We are an innovative Mind Wellness technology company in the Digital Health area, founded by a team of technopreneurs, neuroscientists, data scientists and game specialists with a vision of offering solutions for a healthier mind. We hope to help make a positive impact in society by working with partners, distributors and clients to advocate mental health and brain fitness for both …",
    "location": "Chennai, Tamil Nadu",
    "listingDate": "2024-05-10T07:38:24Z",
    "careersPage": "https://www.hubspot.com/careers",
    "emails": []
  }
]